WINDOW_SIZE = "800x600"
PREVIEW_SIZE = (300, 300)
BATCH_SIZE = 100
COLOR_SAMPLE_STEP = 5000
MAX_COLORS = 100
COLOR_BOX_SIZE = 50
COMP_COLOR_BOX_SIZE = 25

BASIC_COLORS = {
    'красный': (255, 0, 0),
    'зеленый': (0, 255, 0),
    'синий': (0, 0, 255),
    'желтый': (255, 255, 0),
    'пурпурный': (255, 0, 255),
    'голубой': (0, 255, 255),
    'белый': (255, 255, 255),
    'черный': (0, 0, 0),
    'серый': (128, 128, 128),
    'оранжевый': (255, 165, 0),
    'коричневый': (165, 42, 42),
    'розовый': (255, 192, 203)
} 